EARL-language-reference.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-07-02 Tue 22:46 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>EARL Lanugage Reference</title>
<meta name="author" content="Zachary Haskins (malloc-nbytes)" />
<meta name="description" content="The &quot;ins&quot; and &quot;outs&quot; of EARL" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>

</head>
<body>
<div id="content" class="content">
<h1 class="title">EARL Lanugage Reference</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org7637217">Your First Program</a></li>
<li><a href="#org4a3e16b">Variable Declarations</a></li>
<li><a href="#orge7aca8f">Mutation</a></li>
<li><a href="#org535b343">Conditionals</a></li>
<li><a href="#org8d50d66"><span class="todo TODO">TODO</span> Pattern Matching</a>
<ul>
<li><a href="#org15d037f">Examples</a></li>
</ul>
</li>
<li><a href="#org45d43a9">While Loops</a></li>
<li><a href="#org0fa6700">For Loops</a></li>
<li><a href="#org65c3421">Function Definitions</a>
<ul>
<li><a href="#org0601e91">Grammar</a></li>
<li><a href="#org6a0dd65">Examples</a></li>
</ul>
</li>
<li><a href="#org05efb7e">Statement Expressions</a>
<ul>
<li><a href="#org2496496">Grammar</a></li>
<li><a href="#org1e8b72a">Examples</a></li>
</ul>
</li>
<li><a href="#org498bdfc">Imports</a>
<ul>
<li><a href="#org2f107c3">Grammar</a></li>
<li><a href="#org9090fd9">Examples</a></li>
</ul>
</li>
<li><a href="#org7ef6fca">Modules</a>
<ul>
<li><a href="#org8a0bf83">Grammar</a></li>
<li><a href="#orga575f3b">Examples</a></li>
</ul>
</li>
<li><a href="#org4ce961f">Attributes</a>
<ul>
<li><a href="#orgba4c084">Grammar</a></li>
<li><a href="#org87edf98">Examples</a></li>
</ul>
</li>
<li><a href="#orgaec70c7">Classes</a>
<ul>
<li><a href="#org443d75b">Grammar</a></li>
<li><a href="#org1b6f27b">Examples</a></li>
</ul>
</li>
<li><a href="#org0ecf156">Datatypes</a>
<ul>
<li><a href="#org83db1a2"><code>int</code></a></li>
<li><a href="#org1b48661"><code>bool</code></a></li>
<li><a href="#org9c6a86a"><code>char</code></a></li>
<li><a href="#orgc2f58b6"><code>str</code></a></li>
<li><a href="#org4c386d8"><code>list</code></a></li>
<li><a href="#orgbd76679"><code>option</code></a></li>
<li><a href="#orgc902ca2"><code>file</code></a></li>
<li><a href="#org5bfed03"><code>unit</code></a></li>
</ul>
</li>
<li><a href="#org99d96b9">Intrinsics</a>
<ul>
<li><a href="#org23c7304"><code>print</code></a>
<ul>
<li><a href="#orge25e769"><code>print(arg1: any, arg2: any, ..., argN: any) -&gt; unit</code></a></li>
</ul>
</li>
<li><a href="#orgd842865"><code>assert</code></a>
<ul>
<li><a href="#org0ec8f19"><code>assert(arg1: any, arg2: any, ..., argN: any) -&gt; unit</code></a></li>
</ul>
</li>
<li><a href="#orgebc70e8"><code>len</code></a>
<ul>
<li><a href="#org62d4844"><code>len(arg: list|str) -&gt; int</code></a></li>
</ul>
</li>
<li><a href="#orgce19d1b"><code>some(arg: any) -&gt; option&lt;any&gt;</code></a></li>
<li><a href="#org528c02f"><code>type(arg: any) -&gt; str</code></a></li>
<li><a href="#org224a62b"><code>open(fp: str, mode: str) -&gt; file</code></a></li>
<li><a href="#org4efacdf"><code>unimplemented(arg1, arg2, ..., argN)</code></a></li>
</ul>
</li>
<li><a href="#orgafcb791">Member Intrinsics</a>
<ul>
<li><a href="#org16a9a60"><code>list</code> Implementes</a>
<ul>
<li><a href="#org01c1efe"><code>rev() -&gt; unit</code></a></li>
<li><a href="#orgc7e7986"><code>append(arg1: any, arg2: any, ..., argN: any) -&gt; unit</code></a></li>
<li><a href="#orga5a3050"><code>pop(idx: int) -&gt; unit</code></a></li>
</ul>
</li>
<li><a href="#org15fcf78"><code>str</code> Implements</a>
<ul>
<li><a href="#org0ca2557"><code>split(delim: str) -&gt; list</code></a></li>
<li><a href="#org900a16d"><code>pop(idx: int) -&gt; unit</code></a></li>
</ul>
</li>
<li><a href="#orgb093ea2"><code>char</code> Implements</a>
<ul>
<li><a href="#org2c288c6"><code>ascii() -&gt; int</code></a></li>
</ul>
</li>
<li><a href="#org47f64d0"><code>option</code> Implements</a>
<ul>
<li><a href="#org7c96de4"><code>is_none() -&gt; bool</code></a></li>
<li><a href="#org5c4ff9f"><code>is_some() -&gt; bool</code></a></li>
</ul>
</li>
<li><a href="#org8e7d80e"><code>file</code> Implements</a>
<ul>
<li><a href="#orgfd2d415"><code>close() -&gt; unit</code></a></li>
<li><a href="#org578d62a"><code>read() -&gt; str</code></a></li>
<li><a href="#orgcfd59fa"><code>dump() -&gt; unit</code></a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgf9ece80">StdLib</a>
<ul>
<li><a href="#orge935a9c">Stack</a>
<ul>
<li><a href="#org3556092"><b>Import</b>: <code>"std/stack.earl"</code></a></li>
<li><a href="#org5a49018"><b>Module</b>: <code>Stack</code></a></li>
<li><a href="#org18d889b"><b>Class List</b>:</a></li>
<li><a href="#org5a5ad0a"><code>T [init: list] -&gt; Stack.T</code></a></li>
<li><a href="#org1dc08da">Implements</a></li>
<li><a href="#org667c30e"><b>Function List</b>: <i>None</i></a></li>
<li><a href="#orgf883822"><b>Examples</b></a></li>
</ul>
</li>
<li><a href="#orgf876ad6">Set</a>
<ul>
<li><a href="#org3ca3cf5"><b>Import</b>: <code>"std/set.earl"</code></a></li>
<li><a href="#org05205f6"><b>Module</b>: <code>Set</code></a></li>
<li><a href="#org1d95f00"><b>Class List</b>:</a></li>
<li><a href="#org5a425b7"><code>T [init: list] -&gt; Set.T</code></a></li>
<li><a href="#orgf8864f2">Implements</a></li>
<li><a href="#orgf9855f9"><b>Function List</b>: <i>None</i></a></li>
<li><a href="#org20388e4"><span class="todo TODO">TODO</span> <b>Examples</b></a></li>
</ul>
</li>
<li><a href="#org5060cfc">List</a>
<ul>
<li><a href="#org8bb50f3"><b>Import</b>: <code>"std/list.earl"</code></a></li>
<li><a href="#org41b2aab"><b>Module</b>: <code>List</code></a></li>
<li><a href="#org992bef3"><b>Class List</b>: <i>None</i></a></li>
<li><a href="#org83ca638"><b>Function List</b>:</a></li>
<li><a href="#org95d9229"><code>preset(elem: any, cap: int) -&gt; list</code></a></li>
<li><a href="#orgac9d876"><code>from_range(start: int, stop: int, stride: int) -&gt; list[int]</code></a></li>
<li><a href="#orgbe4af8e"><code>fill(@ref lst: list, k: any) -&gt; unit</code></a></li>
<li><a href="#org80f6d04"><code>sum(@ref lst: list[int]) -&gt; int</code></a></li>
<li><a href="#org9cb3921"><code>find(@ref lst: list, @ref elem: any) -&gt; int</code></a></li>
<li><a href="#org6c8f2ce"><code>count(@ref lst: list, @ref elem: any) -&gt; int</code></a></li>
</ul>
</li>
<li><a href="#orgf5d471b">IO</a>
<ul>
<li><a href="#org0f9191a"><b>Import</b>: <code>"std/io.earl"</code></a></li>
<li><a href="#orgc1f021c"><b>Module</b>: <code>IO</code></a></li>
<li><a href="#org72e2f92"><b>Class List</b>: <i>None</i></a></li>
<li><a href="#orgf4550fe"><b>Function List</b>:</a></li>
<li><a href="#org8fa8ab7"><code>file_to_str(fp: str) -&gt; str</code></a></li>
</ul>
</li>
<li><a href="#org2414192">Math</a>
<ul>
<li><a href="#org68d3601"><b>Import</b>: <code>"std/math.earl"</code></a></li>
<li><a href="#org3ba048e"><b>Module</b>: <code>Math</code></a></li>
<li><a href="#org86b594d"><b>Class List</b>: <i>None</i></a></li>
<li><a href="#orga78104b"><b>Function List</b>:</a></li>
<li><a href="#orgebf1852"><code>max(x: int, y: int) -&gt; int</code></a></li>
<li><a href="#org05bd024"><code>min(x: int, y: int) -&gt; int</code></a></li>
<li><a href="#org73da2de"><code>abs(x: int) -&gt;</code> \(\mathbb{Z}^+\)</a></li>
</ul>
</li>
<li><a href="#org38b4779">Utils</a>
<ul>
<li><a href="#org1f2fb2b"><b>Import</b>: <code>"std/utils.earl"</code></a></li>
<li><a href="#org8cbe6ed"><b>Module</b>: <code>Utils</code></a></li>
<li><a href="#org1f5fc1c"><b>Class List</b>: <i>None</i></a></li>
<li><a href="#org3bc1076"><b>Function List</b>:</a></li>
<li><a href="#orge602669"><code>is_even(n: int) -&gt; bool</code></a></li>
<li><a href="#org0122737"><code>swap(@ref x1, @ref x2) -&gt; unit</code></a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
<b>NOTE</b>:
</p>

<ol class="org-ol">
<li><code>This text format represents keywords</code></li>
<li><i>This test format represents a type of grammar</i></li>
<li>&lt;text&gt; represents an identifier</li>
<li>| represents OR</li>
<li>[text] means list</li>
<li>*(text) either 0 or more</li>
<li>?(text) means 0 or 1</li>
<li>"text" represents a string</li>
</ol>
<div id="outline-container-org7637217" class="outline-2">
<h2 id="org7637217">Your First Program</h2>
<div class="outline-text-2" id="text-org7637217">
<p>
To jump right into testing out EARL, do the following to implement a <i>Hello World!</i> program.
</p>

<p>
Create a new file called <code>hello.earl</code>
</p>

<pre class="example" id="org75b8dfd">
print("Hello World!");
</pre>

<p>
Then run
</p>

<div class="org-src-container">
<pre class="src src-bash">earl ./hello.earl
</pre>
</div>

<p>
Output:
</p>

<pre class="example" id="orgaed65c8">
Hello World!
</pre>
</div>
</div>
<div id="outline-container-org4a3e16b" class="outline-2">
<h2 id="org4a3e16b">Variable Declarations</h2>
<div class="outline-text-2" id="text-org4a3e16b">
<p>
<code>let</code> &lt;id&gt; = <i>expr</i>;
</p>
</div>
</div>
<div id="outline-container-orge7aca8f" class="outline-2">
<h2 id="orge7aca8f">Mutation</h2>
<div class="outline-text-2" id="text-orge7aca8f">
<p>
&lt;id&gt; | <i>expr</i> = <i>expr</i>;
</p>
</div>
</div>
<div id="outline-container-org535b343" class="outline-2">
<h2 id="org535b343">Conditionals</h2>
<div class="outline-text-2" id="text-org535b343">
<p>
<code>if</code> <i>expr</i> <b>{</b> [stmt] <b>}</b>
</p>

<p>
<code>else if</code> <i>expr</i> <b>{</b> [stmt] <b>}</b>
</p>

<p>
<code>else</code> <b>{</b> [stmt] <b>}</b>
</p>
</div>
</div>
<div id="outline-container-org8d50d66" class="outline-2">
<h2 id="org8d50d66"><span class="todo TODO">TODO</span> Pattern Matching</h2>
<div class="outline-text-2" id="text-org8d50d66">
<blockquote>
<p>
Pattern matching allows you to match on some pattern. This is
the case for all primitives <code>int</code>, <code>str</code>, <code>list</code> etc.
</p>

<p>
A <code>match</code> consists of a two things.
</p>
<ol class="org-ol">
<li>The pattern &rarr; this comes right after the <code>match</code> keyword</li>
<li>Branches &rarr; these are all the different patterns can be</li>
</ol>

<p>
Each branch can either specify one pattern or multiple patterns with the <code>|</code> (or) operator.
The <code>when</code> keyword acts as a <i>guard</i> for the branch. If the pattern matches, only then is the
<i>guard</i> evaluated. If the <i>guard</i> is true, only then will the branch activate.
</p>

<p>
And finally, the base case consists of the pattern <code>_</code>. If none of the other branches <b>above</b> this
one happens, this one is guaranteed to happen (unless there is a guard).
</p>
</blockquote>

<p>
Grammar TODO
</p>
</div>
<div id="outline-container-org15d037f" class="outline-3">
<h3 id="org15d037f">Examples</h3>
<div class="outline-text-3" id="text-org15d037f">
<pre class="example" id="org64f2ad3">
let x = 4;
let msg = "foo";

match x {
    1 -&gt; { print("x is 1"); }
    2 | 3 -&gt; { print("x is two or three"); }
    [1,2,3] when type(x) == "list" -&gt; { print(x is a list and is [1,2,3]") };
    4 when msg = "bar" -&gt; { print("x is 4 with msg = bar"); }
    4 when msg = "foo" -&gt; { print("x is 4 with msg = foo"); }
    _ when msg = "hello" -&gt; { print("base case, 4 is something else and msg = hello"); }
    _ -&gt; { print("base case, 4 is something else"); }
}
</pre>

<p>
Output:
</p>

<pre class="example" id="org551f8ed">
x is 4 with msg = foo
</pre>

<pre class="example" id="org5bbb57e">
let x = some(4);

match x {
    none -&gt; {
        print("x is none");
    }
    some(3) -&gt; {
        print("x is some 3");
    }
    some(k) when k % 2 == 1 -&gt; {
        print("x is something and is odd");
    }
    some(k) -&gt; {
        # This branch will execute.
        # `k` is the unwrapped value of `x`.
        print("x is: ", k);
        print(x.unwrap() == k);
    }
    some(_) -&gt; {
        print("x is something");
    }
    _ -&gt; {
        print("x is something else");
    }
}
</pre>

<p>
Output:
</p>

<pre class="example" id="org005ef56">
x is: 4
true
</pre>
</div>
</div>
</div>
