EARL-language-reference.org
* For Loops

#+begin_quote
As of now, the =for= loop only enumerates by incrementing
by 1. It takes a start ($s$) and an end ($e$) and will not end until
$s = e$.

\[
\sum_{i = start}^{i < end} i = i + 1
\]

You can modify =i= within the body of the loop.

#+end_quote


=for= <id> =in= /expr/ .. /expr/ *{* [stmt] *}*

* Function Definitions

#+begin_quote
This is how to create a function. See [[Attributes]] for a
description on /attributes/.
#+end_quote

** Grammar

*( =@= [ =pub= | =world= ])

=fn= <id> *(* [ * ( =@ref= ) <id> ] *)* *{* [stmt] *}*

** Examples

#+begin_example
@world @pub
fn func1(@ref x, y, @ref z) {
    ...
}

fn func2() {
    ...
}
#+end_example

* Statement Expressions

#+begin_quote
Statement expressions are statements that are only evaluated
for their side effects such as printing, file IO, or in-place mutation
such as =List.rev=.
#+end_quote

** Grammar

<id> *( =(= /expr/ =)= | =[= /expr/ =]= | =.= <ident> ) =;=

** Examples

#+begin_example
print("hello world");
my_list.rev();
#+end_example

* Imports

#+begin_quote
EARL looks for the files relative to the directory
that it was invoked in. During runtime, if an =import=
statement is hit, it will immediately interpret that file.
If there is no processing in the =@world= scope, only the
function definitions are gathered.
#+end_quote

** Grammar

=import= "filepath"

** Examples

#+begin_example
import "std/list.earl"
import "std/math.earl"
import "std/utils.earl"
#+end_example

* Modules

#+begin_quote
/Modules/ allow other files to access resources to the
file that has the module declared in it. If a file does
not have it, the entire file is private. While modules
do allow other files to access resources, only resources
that have the =@pub= attribute.

*It is expected to have the module declaration at the top of the file.
If you do not follow this rule, undefined behavior will ocurr.*
#+end_quote

** Grammar

=mod= <id>

** Examples

file: =my-math.earl=
#+begin_example
mod MyMath

fn sum(a, b) { return a+b; }
#+end_example

file: =main.earl=
#+begin_example
mod Main

import "my-math.earl"

let s = MyMath.sum(1, 2);
#+end_example

* Attributes

#+begin_quote
Attributes embeds meta information into variables
and functions. You can have none, one, or multiple.

| Name     | Vars          | Funcs | Desc                                        |
|----------+---------------+-------+---------------------------------------------|
| =@pub=   | UNIMPLEMENTED | YES   | Makes the function available to other files |
| =@world= | NO            | YES   | The function closes in the world scope      |
| =@ref=   | YES           | NO    | Declares the var to be a reference          |

*NOTE:* =@ref= can be used as a function parameter and that function will
take a reference to the value passed to it.
#+end_quote

** Grammar

=@= *(pub | world | ref)

** Examples

#+begin_example
@world @pub
fn test_world() {
    # `i` will print since it is in the world scope.
    # The function is also marked as public so other
    # modules can have access to this function.
    print(i)
}

@pub
fn take_ref(@ref ptr) {
    ptr = ptr + 1;
}

let i = 1;
test_world();

@ref let ptr = i;
ptr = ptr + 1;

assert(ptr == 2 && i == 2);

take_ref(i);

assert(i == 3);

#+end_example

* Classes

#+begin_quote
While classes are available, support for inheritance is not yet implemented.
#+end_quote

** Grammar

=@= *(pub | world | ref)

=class= <id> ?(=[= <arg1>, <arg2>,..., <argN> =]=) ={=

    =@= *(pub | world | ref) <member1> = <id> | /expr/ =;=

    =@= *(pub | world | ref) <member2> = <id> | /expr/ =;=

    <methods>

=}=

** Examples

#+begin_example
# This class takes no arguments for the
# constructors and is also not public,
# so other modules cannot use this class.

class NoPassesArgs {
    x = 1;
    y = 2;

    @pub fn print() {
        The use of `this` keyword is optional
        print(this.x, y);
    }
}
#+end_example

#+begin_example
@pub class Point [x, y, name] {
    x = x;
    y = y;
    name = name;

    # Because this is public, you can access
    # it directly from outside the class.
    @pub desc = "A point class"

    @pub set_x(newx) {
        this.x = newx
    }

    @pub dump() {
        print(this.x);
        print(this.y);
        print(this.name);
        print(this.desc);
    }
}
#+end_example

#+begin_example
@pub class Stack [init] {
    # You could just assign `init` to `lst` here,
    # but for this example, this is done in the constructor.
    lst = [];
    sz = len(lst);

    # The constructor gets called
    # right after class instantiation.
    fn constructor() {
        for i in 0..len(init) {
            this.push(init[i]);
        }
    }

    @pub fn push(x) {
        this.lst.append(x);
        this.sz = this.sz+1;
    }

    @pub fn pop() {
        this.lst.pop(this.sz-1);
        this.sz = this.sz-1;
    }
}
#+end_example

* Datatypes

#+begin_quote
The following is a list of the currently implemented primitive types.
#+end_quote

** =int=

#+begin_quote
Your basic 32 bit integer datatype.

*Note*: They *do* over/under-flow
#+end_quote

** =bool=

#+begin_quote
The boolean datatype. Can either be =true= or =false=.
#+end_quote

** =char=

#+begin_quote
A single character. They are surrounded by single quotes ='=.
#+end_quote

