EARL-language-reference.html
<div id="outline-container-org45d43a9" class="outline-2">
<h2 id="org45d43a9">While Loops</h2>
<div class="outline-text-2" id="text-org45d43a9">
<p>
<code>while</code> <i>expr</i> <b>{</b> [stmt] <b>}</b>
</p>
</div>
</div>
<div id="outline-container-org0fa6700" class="outline-2">
<h2 id="org0fa6700">For Loops</h2>
<div class="outline-text-2" id="text-org0fa6700">
<blockquote>
<p>
As of now, the <code>for</code> loop only enumerates by incrementing
by 1. It takes a start (\(s\)) and an end (\(e\)) and will not end until
\(s = e\).
</p>

<p>
\[
\sum_{i = start}^{i < end} i = i + 1
\]
</p>

<p>
You can modify <code>i</code> within the body of the loop.
</p>
</blockquote>


<p>
<code>for</code> &lt;id&gt; <code>in</code> <i>expr</i> .. <i>expr</i> <b>{</b> [stmt] <b>}</b>
</p>
</div>
</div>
<div id="outline-container-org65c3421" class="outline-2">
<h2 id="org65c3421">Function Definitions</h2>
<div class="outline-text-2" id="text-org65c3421">
<blockquote>
<p>
This is how to create a function. See <a href="#org4ce961f">Attributes</a> for a
description on <i>attributes</i>.
</p>
</blockquote>
</div>
<div id="outline-container-org0601e91" class="outline-3">
<h3 id="org0601e91">Grammar</h3>
<div class="outline-text-3" id="text-org0601e91">
<p>
*( <code>@</code> [ <code>pub</code> | <code>world</code> ])
</p>

<p>
<code>fn</code> &lt;id&gt; <b>(</b> [ * ( <code>@ref</code> ) &lt;id&gt; ] <b>)</b> <b>{</b> [stmt] <b>}</b>
</p>
</div>
</div>
<div id="outline-container-org6a0dd65" class="outline-3">
<h3 id="org6a0dd65">Examples</h3>
<div class="outline-text-3" id="text-org6a0dd65">
<pre class="example" id="org5458f4c">
@world @pub
fn func1(@ref x, y, @ref z) {
    ...
}

fn func2() {
    ...
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org05efb7e" class="outline-2">
<h2 id="org05efb7e">Statement Expressions</h2>
<div class="outline-text-2" id="text-org05efb7e">
<blockquote>
<p>
Statement expressions are statements that are only evaluated
for their side effects such as printing, file IO, or in-place mutation
such as <code>List.rev</code>.
</p>
</blockquote>
</div>
<div id="outline-container-org2496496" class="outline-3">
<h3 id="org2496496">Grammar</h3>
<div class="outline-text-3" id="text-org2496496">
<p>
&lt;id&gt; *( <code>(</code> <i>expr</i> <code>)</code> | <code>[</code> <i>expr</i> <code>]</code> | <code>.</code> &lt;ident&gt; ) <code>;</code>
</p>
</div>
</div>
<div id="outline-container-org1e8b72a" class="outline-3">
<h3 id="org1e8b72a">Examples</h3>
<div class="outline-text-3" id="text-org1e8b72a">
<pre class="example" id="org1699f88">
print("hello world");
my_list.rev();
</pre>
</div>
</div>
</div>
<div id="outline-container-org498bdfc" class="outline-2">
<h2 id="org498bdfc">Imports</h2>
<div class="outline-text-2" id="text-org498bdfc">
<blockquote>
<p>
EARL looks for the files relative to the directory
that it was invoked in. During runtime, if an <code>import</code>
statement is hit, it will immediately interpret that file.
If there is no processing in the <code>@world</code> scope, only the
function definitions are gathered.
</p>
</blockquote>
</div>
<div id="outline-container-org2f107c3" class="outline-3">
<h3 id="org2f107c3">Grammar</h3>
<div class="outline-text-3" id="text-org2f107c3">
<p>
<code>import</code> "filepath"
</p>
</div>
</div>
<div id="outline-container-org9090fd9" class="outline-3">
<h3 id="org9090fd9">Examples</h3>
<div class="outline-text-3" id="text-org9090fd9">
<pre class="example" id="org449e803">
import "std/list.earl"
import "std/math.earl"
import "std/utils.earl"
</pre>
</div>
</div>
</div>
<div id="outline-container-org7ef6fca" class="outline-2">
<h2 id="org7ef6fca">Modules</h2>
<div class="outline-text-2" id="text-org7ef6fca">
<blockquote>
<p>
<i>Modules</i> allow other files to access resources to the
file that has the module declared in it. If a file does
not have it, the entire file is private. While modules
do allow other files to access resources, only resources
that have the <code>@pub</code> attribute.
</p>

<p>
<b>It is expected to have the module declaration at the top of the file.
If you do not follow this rule, undefined behavior will ocurr.</b>
</p>
</blockquote>
</div>
<div id="outline-container-org8a0bf83" class="outline-3">
<h3 id="org8a0bf83">Grammar</h3>
<div class="outline-text-3" id="text-org8a0bf83">
<p>
<code>mod</code> &lt;id&gt;
</p>
</div>
</div>
<div id="outline-container-orga575f3b" class="outline-3">
<h3 id="orga575f3b">Examples</h3>
<div class="outline-text-3" id="text-orga575f3b">
<p>
file: <code>my-math.earl</code>
</p>
<pre class="example" id="orge601cbf">
mod MyMath

fn sum(a, b) { return a+b; }
</pre>

<p>
file: <code>main.earl</code>
</p>
<pre class="example" id="org39a25c0">
mod Main

import "my-math.earl"

let s = MyMath.sum(1, 2);
</pre>
</div>
</div>
</div>
<div id="outline-container-org4ce961f" class="outline-2">
<h2 id="org4ce961f">Attributes</h2>
<div class="outline-text-2" id="text-org4ce961f">
<blockquote>
<p>
Attributes embeds meta information into variables
and functions. You can have none, one, or multiple.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Name</th>
<th scope="col" class="org-left">Vars</th>
<th scope="col" class="org-left">Funcs</th>
<th scope="col" class="org-left">Desc</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>@pub</code></td>
<td class="org-left">UNIMPLEMENTED</td>
<td class="org-left">YES</td>
<td class="org-left">Makes the function available to other files</td>
</tr>

<tr>
<td class="org-left"><code>@world</code></td>
<td class="org-left">NO</td>
<td class="org-left">YES</td>
<td class="org-left">The function closes in the world scope</td>
</tr>

<tr>
<td class="org-left"><code>@ref</code></td>
<td class="org-left">YES</td>
<td class="org-left">NO</td>
<td class="org-left">Declares the var to be a reference</td>
</tr>
</tbody>
</table>

<p>
<b>NOTE:</b> <code>@ref</code> can be used as a function parameter and that function will
take a reference to the value passed to it.
</p>
</blockquote>
</div>
<div id="outline-container-orgba4c084" class="outline-3">
<h3 id="orgba4c084">Grammar</h3>
<div class="outline-text-3" id="text-orgba4c084">
<p>
<code>@</code> *(pub | world | ref)
</p>
</div>
</div>
<div id="outline-container-org87edf98" class="outline-3">
<h3 id="org87edf98">Examples</h3>
<div class="outline-text-3" id="text-org87edf98">
<pre class="example" id="org70bead3">
@world @pub
fn test_world() {
    # `i` will print since it is in the world scope.
    # The function is also marked as public so other
    # modules can have access to this function.
    print(i)
}

@pub
fn take_ref(@ref ptr) {
    ptr = ptr + 1;
}

let i = 1;
test_world();

@ref let ptr = i;
ptr = ptr + 1;

assert(ptr == 2 &amp;&amp; i == 2);

take_ref(i);

assert(i == 3);

</pre>
</div>
</div>
</div>
<div id="outline-container-orgaec70c7" class="outline-2">
<h2 id="orgaec70c7">Classes</h2>
<div class="outline-text-2" id="text-orgaec70c7">
<blockquote>
<p>
While classes are available, support for inheritance is not yet implemented.
</p>
</blockquote>
</div>
<div id="outline-container-org443d75b" class="outline-3">
<h3 id="org443d75b">Grammar</h3>
<div class="outline-text-3" id="text-org443d75b">
<p>
<code>@</code> *(pub | world | ref)
</p>

<p>
<code>class</code> &lt;id&gt; ?(<code>[</code> &lt;arg1&gt;, &lt;arg2&gt;,&#x2026;, &lt;argN&gt; <code>]</code>) <code>{</code>
</p>

<p>
<code>@</code> *(pub | world | ref) &lt;member1&gt; = &lt;id&gt; | <i>expr</i> <code>;</code>
</p>

<p>
<code>@</code> *(pub | world | ref) &lt;member2&gt; = &lt;id&gt; | <i>expr</i> <code>;</code>
</p>

<p>
&lt;methods&gt;
</p>

<p>
<code>}</code>
</p>
</div>
</div>
<div id="outline-container-org1b6f27b" class="outline-3">
<h3 id="org1b6f27b">Examples</h3>
<div class="outline-text-3" id="text-org1b6f27b">
<pre class="example" id="org43c33f9">
# This class takes no arguments for the
# constructors and is also not public,
# so other modules cannot use this class.

class NoPassesArgs {
    x = 1;
    y = 2;

    @pub fn print() {
        The use of `this` keyword is optional
        print(this.x, y);
    }
}
</pre>

<pre class="example" id="org5b04e87">
@pub class Point [x, y, name] {
    x = x;
    y = y;
    name = name;

    # Because this is public, you can access
    # it directly from outside the class.
    @pub desc = "A point class"

    @pub set_x(newx) {
        this.x = newx
    }

    @pub dump() {
        print(this.x);
        print(this.y);
        print(this.name);
        print(this.desc);
    }
}
</pre>

<pre class="example" id="org340419a">
@pub class Stack [init] {
    # You could just assign `init` to `lst` here,
    # but for this example, this is done in the constructor.
    lst = [];
    sz = len(lst);

    # The constructor gets called
    # right after class instantiation.
    fn constructor() {
        for i in 0..len(init) {
            this.push(init[i]);
        }
    }

    @pub fn push(x) {
        this.lst.append(x);
        this.sz = this.sz+1;
    }

    @pub fn pop() {
        this.lst.pop(this.sz-1);
        this.sz = this.sz-1;
    }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org0ecf156" class="outline-2">
<h2 id="org0ecf156">Datatypes</h2>
<div class="outline-text-2" id="text-org0ecf156">
<blockquote>
<p>
The following is a list of the currently implemented primitive types.
</p>
</blockquote>
</div>
<div id="outline-container-org83db1a2" class="outline-3">
<h3 id="org83db1a2"><code>int</code></h3>
<div class="outline-text-3" id="text-org83db1a2">
<blockquote>
<p>
Your basic 32 bit integer datatype.
</p>

<p>
<b>Note</b>: They <b>do</b> over/under-flow
</p>
</blockquote>
</div>
</div>
<div id="outline-container-org1b48661" class="outline-3">
<h3 id="org1b48661"><code>bool</code></h3>
<div class="outline-text-3" id="text-org1b48661">
<blockquote>
<p>
The boolean datatype. Can either be <code>true</code> or <code>false</code>.
</p>
</blockquote>
</div>
</div>
<div id="outline-container-org9c6a86a" class="outline-3">
<h3 id="org9c6a86a"><code>char</code></h3>
<div class="outline-text-3" id="text-org9c6a86a">
<blockquote>
<p>
A single character. They are surrounded by single quotes <code>'</code>.
</p>
</blockquote>
</div>
</div>
