EARL-language-reference.org
** =str=

#+begin_quote
A string is a list of =char='s. They are surrounded with double quotes ="=.
#+end_quote

** =list=

#+begin_quote
A list is a growable array. They can hold any datatype, and you
can even mix multiple datatypes in a single list.
#+end_quote

** =option=

#+begin_quote
Because all variables need to be initialized when using a `let` statement,
it may be annoying to be forced to give it some initial value. The =none= type
allows you to set a variable to it and can be reassigned later.

To assign a value to a none-type, you must wrap it in =some= i.e.,

=let x = none;=

=x = some(9);=

*Note*: A lot of the functionality of the language will break if you use =none=
as another datatype before giving it an actual value.
#+end_quote

** =file=

#+begin_quote
The =file= type is a file handler. It handles opening, closing, reading, and writing
to files.

*Note*: It is up to the user to =close()= the file handle.
#+end_quote

** =unit=

#+begin_quote
Currently not being used in EARL, only in the interpreter. This type
gets returned when doing things such as side effects, non-returning function calls, etc.
#+end_quote

* Intrinsics

#+begin_quote
Intrinsics are functions that are automatically built into the interpreter.
You do not need to import anything to use these functions.
#+end_quote

** =print=

*** =print(arg1: any, arg2: any, ..., argN: any) -> unit=

#+begin_quote
Will print all elements if it can. Adds a newline at the end and flushes the output.
#+end_quote

** =assert=

*** =assert(arg1: any, arg2: any, ..., argN: any) -> unit=

#+begin_quote
Tests each argument for =1=. If any of the conditions fails,
the program immediately crashes.
#+end_quote

** =len=

*** =len(arg: list|str) -> int=

#+begin_quote
Expects either a =list= or =string=. Will give the length
as an integer.
#+end_quote

** =some(arg: any) -> option<any>=

#+begin_quote
Wraps =arg= in an =option= type.
#+end_quote

** =type(arg: any) -> str=

#+begin_quote
Returns the type of =arg= as a =str=.
#+end_quote

** =open(fp: str, mode: str) -> file=

#+begin_quote
Opens the filepath =fp= with mode =mode=. Mode must either be
=r= for read or =w= for write.
#+end_quote

** =unimplemented(arg1, arg2, ..., argN)=

#+begin_quote
Prints arg1..arg$N$ to =stderr= and exits with non-zero exit code.
#+end_quote

* Member Intrinsics

#+begin_quote
Member intrinsics are the same as intrinsics, except they are
member functions (or methods) that types have built into them.
You access these with the dot `.` notation i.e.,

=let lst = [1,2,3];=

=lst.rev();=
#+end_quote

** =list= Implementes

*** =rev() -> unit=

#+begin_quote
Reverses the list inplace.
#+end_quote

*** =append(arg1: any, arg2: any, ..., argN: any) -> unit=

#+begin_quote
Will append arg1..arg$N$ to the list.
#+end_quote

*** =pop(idx: int) -> unit=

#+begin_quote
Will remove the element at index =idx=.
#+end_quote

** =str= Implements

*** =split(delim: str) -> list=

#+begin_quote
Split a string by the delimiter =delim=.
#+end_quote

*** =pop(idx: int) -> unit=

#+begin_quote
Will remove the element at index =idx=.
#+end_quote

** =char= Implements

*** =ascii() -> int=

#+begin_quote
Returns the ascii code of the character.
#+end_quote

** =option= Implements

*** =is_none() -> bool=

#+begin_quote
Returns =true= if the value is =none=, =false= otherwise.
#+end_quote

*** =is_some() -> bool=

#+begin_quote
Returns =true= if the value is =some=, =false= otherwise.
#+end_quote

** =file= Implements

*** =close() -> unit=

#+begin_quote
Closes an opened file.
#+end_quote

*** =read() -> str=

#+begin_quote
Get the contents of a file as a =str=.
#+end_quote

*** =dump() -> unit=

#+begin_quote
Print the contents of a file.
#+end_quote

* StdLib

#+begin_quote
Upon installing EARL, the standard library is installed into
=/usr/local/include/EARL/std=. The first place that EARL looks
when evaluating an =import= statement is =/usr/local/include/EARL/=.
This means that all you need to do to import these files is do:
=import "std/<file>.earl"=.
#+end_quote

** Stack

*** *Import*: ="std/stack.earl"=

*** *Module*: =Stack=

*** *Class List*:

*** =T [init: list] -> Stack.T=

#+begin_quote
Creates a =Stack= container with the initializer list =init=.
#+end_quote

