EARL-language-reference.html
<div id="outline-container-orgc2f58b6" class="outline-3">
<h3 id="orgc2f58b6"><code>str</code></h3>
<div class="outline-text-3" id="text-orgc2f58b6">
<blockquote>
<p>
A string is a list of <code>char</code>'s. They are surrounded with double quotes <code>"</code>.
</p>
</blockquote>
</div>
</div>
<div id="outline-container-org4c386d8" class="outline-3">
<h3 id="org4c386d8"><code>list</code></h3>
<div class="outline-text-3" id="text-org4c386d8">
<blockquote>
<p>
A list is a growable array. They can hold any datatype, and you
can even mix multiple datatypes in a single list.
</p>
</blockquote>
</div>
</div>
<div id="outline-container-orgbd76679" class="outline-3">
<h3 id="orgbd76679"><code>option</code></h3>
<div class="outline-text-3" id="text-orgbd76679">
<blockquote>
<p>
Because all variables need to be initialized when using a `let` statement,
it may be annoying to be forced to give it some initial value. The <code>none</code> type
allows you to set a variable to it and can be reassigned later.
</p>

<p>
To assign a value to a none-type, you must wrap it in <code>some</code> i.e.,
</p>

<p>
<code>let x = none;</code>
</p>

<p>
<code>x = some(9);</code>
</p>

<p>
<b>Note</b>: A lot of the functionality of the language will break if you use <code>none</code>
as another datatype before giving it an actual value.
</p>
</blockquote>
</div>
</div>
<div id="outline-container-orgc902ca2" class="outline-3">
<h3 id="orgc902ca2"><code>file</code></h3>
<div class="outline-text-3" id="text-orgc902ca2">
<blockquote>
<p>
The <code>file</code> type is a file handler. It handles opening, closing, reading, and writing
to files.
</p>

<p>
<b>Note</b>: It is up to the user to <code>close()</code> the file handle.
</p>
</blockquote>
</div>
</div>
<div id="outline-container-org5bfed03" class="outline-3">
<h3 id="org5bfed03"><code>unit</code></h3>
<div class="outline-text-3" id="text-org5bfed03">
<blockquote>
<p>
Currently not being used in EARL, only in the interpreter. This type
gets returned when doing things such as side effects, non-returning function calls, etc.
</p>
</blockquote>
</div>
</div>
</div>
<div id="outline-container-org99d96b9" class="outline-2">
<h2 id="org99d96b9">Intrinsics</h2>
<div class="outline-text-2" id="text-org99d96b9">
<blockquote>
<p>
Intrinsics are functions that are automatically built into the interpreter.
You do not need to import anything to use these functions.
</p>
</blockquote>
</div>
<div id="outline-container-org23c7304" class="outline-3">
<h3 id="org23c7304"><code>print</code></h3>
<div class="outline-text-3" id="text-org23c7304">
</div>
<div id="outline-container-orge25e769" class="outline-4">
<h4 id="orge25e769"><code>print(arg1: any, arg2: any, ..., argN: any) -&gt; unit</code></h4>
<div class="outline-text-4" id="text-orge25e769">
<blockquote>
<p>
Will print all elements if it can. Adds a newline at the end and flushes the output.
</p>
</blockquote>
</div>
</div>
</div>
<div id="outline-container-orgd842865" class="outline-3">
<h3 id="orgd842865"><code>assert</code></h3>
<div class="outline-text-3" id="text-orgd842865">
</div>
<div id="outline-container-org0ec8f19" class="outline-4">
<h4 id="org0ec8f19"><code>assert(arg1: any, arg2: any, ..., argN: any) -&gt; unit</code></h4>
<div class="outline-text-4" id="text-org0ec8f19">
<blockquote>
<p>
Tests each argument for <code>1</code>. If any of the conditions fails,
the program immediately crashes.
</p>
</blockquote>
</div>
</div>
</div>
<div id="outline-container-orgebc70e8" class="outline-3">
<h3 id="orgebc70e8"><code>len</code></h3>
<div class="outline-text-3" id="text-orgebc70e8">
</div>
<div id="outline-container-org62d4844" class="outline-4">
<h4 id="org62d4844"><code>len(arg: list|str) -&gt; int</code></h4>
<div class="outline-text-4" id="text-org62d4844">
<blockquote>
<p>
Expects either a <code>list</code> or <code>string</code>. Will give the length
as an integer.
</p>
</blockquote>
</div>
</div>
</div>
<div id="outline-container-orgce19d1b" class="outline-3">
<h3 id="orgce19d1b"><code>some(arg: any) -&gt; option&lt;any&gt;</code></h3>
<div class="outline-text-3" id="text-orgce19d1b">
<blockquote>
<p>
Wraps <code>arg</code> in an <code>option</code> type.
</p>
</blockquote>
</div>
</div>
<div id="outline-container-org528c02f" class="outline-3">
<h3 id="org528c02f"><code>type(arg: any) -&gt; str</code></h3>
<div class="outline-text-3" id="text-org528c02f">
<blockquote>
<p>
Returns the type of <code>arg</code> as a <code>str</code>.
</p>
</blockquote>
</div>
</div>
<div id="outline-container-org224a62b" class="outline-3">
<h3 id="org224a62b"><code>open(fp: str, mode: str) -&gt; file</code></h3>
<div class="outline-text-3" id="text-org224a62b">
<blockquote>
<p>
Opens the filepath <code>fp</code> with mode <code>mode</code>. Mode must either be
<code>r</code> for read or <code>w</code> for write.
</p>
</blockquote>
</div>
</div>
<div id="outline-container-org4efacdf" class="outline-3">
<h3 id="org4efacdf"><code>unimplemented(arg1, arg2, ..., argN)</code></h3>
<div class="outline-text-3" id="text-org4efacdf">
<blockquote>
<p>
Prints arg1..arg\(N\) to <code>stderr</code> and exits with non-zero exit code.
</p>
</blockquote>
</div>
</div>
</div>
<div id="outline-container-orgafcb791" class="outline-2">
<h2 id="orgafcb791">Member Intrinsics</h2>
<div class="outline-text-2" id="text-orgafcb791">
<blockquote>
<p>
Member intrinsics are the same as intrinsics, except they are
member functions (or methods) that types have built into them.
You access these with the dot `.` notation i.e.,
</p>

<p>
<code>let lst = [1,2,3];</code>
</p>

<p>
<code>lst.rev();</code>
</p>
</blockquote>
</div>
<div id="outline-container-org16a9a60" class="outline-3">
<h3 id="org16a9a60"><code>list</code> Implementes</h3>
<div class="outline-text-3" id="text-org16a9a60">
</div>
<div id="outline-container-org01c1efe" class="outline-4">
<h4 id="org01c1efe"><code>rev() -&gt; unit</code></h4>
<div class="outline-text-4" id="text-org01c1efe">
<blockquote>
<p>
Reverses the list inplace.
</p>
</blockquote>
</div>
</div>
<div id="outline-container-orgc7e7986" class="outline-4">
<h4 id="orgc7e7986"><code>append(arg1: any, arg2: any, ..., argN: any) -&gt; unit</code></h4>
<div class="outline-text-4" id="text-orgc7e7986">
<blockquote>
<p>
Will append arg1..arg\(N\) to the list.
</p>
</blockquote>
</div>
</div>
<div id="outline-container-orga5a3050" class="outline-4">
<h4 id="orga5a3050"><code>pop(idx: int) -&gt; unit</code></h4>
<div class="outline-text-4" id="text-orga5a3050">
<blockquote>
<p>
Will remove the element at index <code>idx</code>.
</p>
</blockquote>
</div>
</div>
</div>
<div id="outline-container-org15fcf78" class="outline-3">
<h3 id="org15fcf78"><code>str</code> Implements</h3>
<div class="outline-text-3" id="text-org15fcf78">
</div>
<div id="outline-container-org0ca2557" class="outline-4">
<h4 id="org0ca2557"><code>split(delim: str) -&gt; list</code></h4>
<div class="outline-text-4" id="text-org0ca2557">
<blockquote>
<p>
Split a string by the delimiter <code>delim</code>.
</p>
</blockquote>
</div>
</div>
<div id="outline-container-org900a16d" class="outline-4">
<h4 id="org900a16d"><code>pop(idx: int) -&gt; unit</code></h4>
<div class="outline-text-4" id="text-org900a16d">
<blockquote>
<p>
Will remove the element at index <code>idx</code>.
</p>
</blockquote>
</div>
</div>
</div>
<div id="outline-container-orgb093ea2" class="outline-3">
<h3 id="orgb093ea2"><code>char</code> Implements</h3>
<div class="outline-text-3" id="text-orgb093ea2">
</div>
<div id="outline-container-org2c288c6" class="outline-4">
<h4 id="org2c288c6"><code>ascii() -&gt; int</code></h4>
<div class="outline-text-4" id="text-org2c288c6">
<blockquote>
<p>
Returns the ascii code of the character.
</p>
</blockquote>
</div>
</div>
</div>
<div id="outline-container-org47f64d0" class="outline-3">
<h3 id="org47f64d0"><code>option</code> Implements</h3>
<div class="outline-text-3" id="text-org47f64d0">
</div>
<div id="outline-container-org7c96de4" class="outline-4">
<h4 id="org7c96de4"><code>is_none() -&gt; bool</code></h4>
<div class="outline-text-4" id="text-org7c96de4">
<blockquote>
<p>
Returns <code>true</code> if the value is <code>none</code>, <code>false</code> otherwise.
</p>
</blockquote>
</div>
</div>
<div id="outline-container-org5c4ff9f" class="outline-4">
<h4 id="org5c4ff9f"><code>is_some() -&gt; bool</code></h4>
<div class="outline-text-4" id="text-org5c4ff9f">
<blockquote>
<p>
Returns <code>true</code> if the value is <code>some</code>, <code>false</code> otherwise.
</p>
</blockquote>
</div>
</div>
</div>
<div id="outline-container-org8e7d80e" class="outline-3">
<h3 id="org8e7d80e"><code>file</code> Implements</h3>
<div class="outline-text-3" id="text-org8e7d80e">
</div>
<div id="outline-container-orgfd2d415" class="outline-4">
<h4 id="orgfd2d415"><code>close() -&gt; unit</code></h4>
<div class="outline-text-4" id="text-orgfd2d415">
<blockquote>
<p>
Closes an opened file.
</p>
</blockquote>
</div>
</div>
<div id="outline-container-org578d62a" class="outline-4">
<h4 id="org578d62a"><code>read() -&gt; str</code></h4>
<div class="outline-text-4" id="text-org578d62a">
<blockquote>
<p>
Get the contents of a file as a <code>str</code>.
</p>
</blockquote>
</div>
</div>
<div id="outline-container-orgcfd59fa" class="outline-4">
<h4 id="orgcfd59fa"><code>dump() -&gt; unit</code></h4>
<div class="outline-text-4" id="text-orgcfd59fa">
<blockquote>
<p>
Print the contents of a file.
</p>
</blockquote>
</div>
</div>
</div>
</div>
<div id="outline-container-orgf9ece80" class="outline-2">
<h2 id="orgf9ece80">StdLib</h2>
<div class="outline-text-2" id="text-orgf9ece80">
<blockquote>
<p>
Upon installing EARL, the standard library is installed into
<code>/usr/local/include/EARL/std</code>. The first place that EARL looks
when evaluating an <code>import</code> statement is <code>/usr/local/include/EARL/</code>.
This means that all you need to do to import these files is do:
<code>import "std/&lt;file&gt;.earl"</code>.
</p>
</blockquote>
</div>
<div id="outline-container-orge935a9c" class="outline-3">
<h3 id="orge935a9c">Stack</h3>
<div class="outline-text-3" id="text-orge935a9c">
</div>
<div id="outline-container-org3556092" class="outline-4">
<h4 id="org3556092"><b>Import</b>: <code>"std/stack.earl"</code></h4>
</div>

<div id="outline-container-org5a49018" class="outline-4">
<h4 id="org5a49018"><b>Module</b>: <code>Stack</code></h4>
</div>

<div id="outline-container-org18d889b" class="outline-4">
<h4 id="org18d889b"><b>Class List</b>:</h4>
</div>

<div id="outline-container-org5a5ad0a" class="outline-4">
<h4 id="org5a5ad0a"><code>T [init: list] -&gt; Stack.T</code></h4>
<div class="outline-text-4" id="text-org5a5ad0a">
<blockquote>
<p>
Creates a <code>Stack</code> container with the initializer list <code>init</code>.
</p>
</blockquote>
</div>
</div>
