EARL-language-reference.html
<div id="outline-container-org1dc08da" class="outline-4">
<h4 id="org1dc08da">Implements</h4>
<div class="outline-text-4" id="text-org1dc08da">
<p>
<code>push(elem: any) -&gt; unit</code>
</p>

<blockquote>
<p>
Inserts <code>elem</code> onto the top of the stack.
</p>
</blockquote>

<p>
<code>pop() -&gt; unit</code>
</p>

<blockquote>
<p>
Removes the most recently inserted element.
</p>
</blockquote>

<p>
<code>top() -&gt; any</code>
</p>

<blockquote>
<p>
Get the most recently added item.
</p>
</blockquote>

<p>
<code>empty() -&gt; bool</code>
</p>

<blockquote>
<p>
Check if the stack is empty
</p>
</blockquote>
</div>
</div>
<div id="outline-container-org667c30e" class="outline-4">
<h4 id="org667c30e"><b>Function List</b>: <i>None</i></h4>
</div>

<div id="outline-container-orgf883822" class="outline-4">
<h4 id="orgf883822"><b>Examples</b></h4>
<div class="outline-text-4" id="text-orgf883822">
<pre class="example" id="org4431bb2">
let s = Stack.T([]);

for i in 0..10 {
    s.push(i);
}

while s.empty() != true {
    print(s.top());
    s.pop();
}
</pre>

<pre class="example" id="org02672fa">
9
8
7
6
5
4
3
2
1
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf876ad6" class="outline-3">
<h3 id="orgf876ad6">Set</h3>
<div class="outline-text-3" id="text-orgf876ad6">
</div>
<div id="outline-container-org3ca3cf5" class="outline-4">
<h4 id="org3ca3cf5"><b>Import</b>: <code>"std/set.earl"</code></h4>
</div>

<div id="outline-container-org05205f6" class="outline-4">
<h4 id="org05205f6"><b>Module</b>: <code>Set</code></h4>
</div>

<div id="outline-container-org1d95f00" class="outline-4">
<h4 id="org1d95f00"><b>Class List</b>:</h4>
</div>

<div id="outline-container-org5a425b7" class="outline-4">
<h4 id="org5a425b7"><code>T [init: list] -&gt; Set.T</code></h4>
<div class="outline-text-4" id="text-org5a425b7">
<p>
<b>Note:</b> The <code>set</code> currently only works with integers.
</p>

<blockquote>
<p>
Creates a <code>Set</code> container with the initializer list <code>init</code>.
</p>
</blockquote>
</div>
</div>
<div id="outline-container-orgf8864f2" class="outline-4">
<h4 id="orgf8864f2">Implements</h4>
<div class="outline-text-4" id="text-orgf8864f2">
<p>
<code>insert(elem: any) -&gt; unit</code>
</p>

<blockquote>
<p>
Inserts <code>elem</code> into the <code>set</code>.
</p>
</blockquote>

<p>
<code>contains(elem: any) -&gt; bool</code>
</p>

<blockquote>
<p>
Check if <code>elem</code> is in the set.
</p>
</blockquote>

<p>
<code>dump() -&gt; unit</code>
</p>

<blockquote>
<p>
Prints the contents of the <code>set</code>.
</p>
</blockquote>
</div>
</div>
<div id="outline-container-orgf9855f9" class="outline-4">
<h4 id="orgf9855f9"><b>Function List</b>: <i>None</i></h4>
</div>

<div id="outline-container-org20388e4" class="outline-4">
<h4 id="org20388e4"><span class="todo TODO">TODO</span> <b>Examples</b></h4>
</div>
</div>
<div id="outline-container-org5060cfc" class="outline-3">
<h3 id="org5060cfc">List</h3>
<div class="outline-text-3" id="text-org5060cfc">
</div>
<div id="outline-container-org8bb50f3" class="outline-4">
<h4 id="org8bb50f3"><b>Import</b>: <code>"std/list.earl"</code></h4>
</div>

<div id="outline-container-org41b2aab" class="outline-4">
<h4 id="org41b2aab"><b>Module</b>: <code>List</code></h4>
</div>

<div id="outline-container-org992bef3" class="outline-4">
<h4 id="org992bef3"><b>Class List</b>: <i>None</i></h4>
</div>

<div id="outline-container-org83ca638" class="outline-4">
<h4 id="org83ca638"><b>Function List</b>:</h4>
</div>

<div id="outline-container-org95d9229" class="outline-4">
<h4 id="org95d9229"><code>preset(elem: any, cap: int) -&gt; list</code></h4>
<div class="outline-text-4" id="text-org95d9229">
<blockquote>
<p>
Create a list filled with <code>elem</code> of length <code>cap</code>.
</p>
</blockquote>
</div>
</div>
<div id="outline-container-orgac9d876" class="outline-4">
<h4 id="orgac9d876"><code>from_range(start: int, stop: int, stride: int) -&gt; list[int]</code></h4>
<div class="outline-text-4" id="text-orgac9d876">
<blockquote>
<p>
Create a list filled with the numbers from <code>start</code> to <code>stop</code> (inclusive)
and increment the number by <code>stride</code>.
</p>
</blockquote>
</div>
</div>
<div id="outline-container-orgbe4af8e" class="outline-4">
<h4 id="orgbe4af8e"><code>fill(@ref lst: list, k: any) -&gt; unit</code></h4>
<div class="outline-text-4" id="text-orgbe4af8e">
<blockquote>
<p>
Fill the list <code>lst</code> with element <code>k</code>.
</p>
</blockquote>
</div>
</div>
<div id="outline-container-org80f6d04" class="outline-4">
<h4 id="org80f6d04"><code>sum(@ref lst: list[int]) -&gt; int</code></h4>
<div class="outline-text-4" id="text-org80f6d04">
<blockquote>
<p>
Sum up all elements of the list <code>lst</code>.
</p>
</blockquote>
</div>
</div>
<div id="outline-container-org9cb3921" class="outline-4">
<h4 id="org9cb3921"><code>find(@ref lst: list, @ref elem: any) -&gt; int</code></h4>
<div class="outline-text-4" id="text-org9cb3921">
<blockquote>
<p>
Return the index that <code>elem</code> appears in <code>lst</code>. Returns <code>-1</code>
if it does not exist.
</p>
</blockquote>
</div>
</div>
<div id="outline-container-org6c8f2ce" class="outline-4">
<h4 id="org6c8f2ce"><code>count(@ref lst: list, @ref elem: any) -&gt; int</code></h4>
<div class="outline-text-4" id="text-org6c8f2ce">
<blockquote>
<p>
Count the number of times that <code>elem</code> appears in <code>lst</code>.
</p>
</blockquote>
</div>
</div>
</div>
<div id="outline-container-orgf5d471b" class="outline-3">
<h3 id="orgf5d471b">IO</h3>
<div class="outline-text-3" id="text-orgf5d471b">
</div>
<div id="outline-container-org0f9191a" class="outline-4">
<h4 id="org0f9191a"><b>Import</b>: <code>"std/io.earl"</code></h4>
</div>

<div id="outline-container-orgc1f021c" class="outline-4">
<h4 id="orgc1f021c"><b>Module</b>: <code>IO</code></h4>
</div>

<div id="outline-container-org72e2f92" class="outline-4">
<h4 id="org72e2f92"><b>Class List</b>: <i>None</i></h4>
</div>

<div id="outline-container-orgf4550fe" class="outline-4">
<h4 id="orgf4550fe"><b>Function List</b>:</h4>
</div>

<div id="outline-container-org8fa8ab7" class="outline-4">
<h4 id="org8fa8ab7"><code>file_to_str(fp: str) -&gt; str</code></h4>
<div class="outline-text-4" id="text-org8fa8ab7">
<blockquote>
<p>
Opens the file at the filepath <code>fp</code> in read (<code>r</code>) mode. Returns
the contents of the file as a <code>str</code> and closes the file.
</p>
</blockquote>
</div>
</div>
</div>
<div id="outline-container-org2414192" class="outline-3">
<h3 id="org2414192">Math</h3>
<div class="outline-text-3" id="text-org2414192">
</div>
<div id="outline-container-org68d3601" class="outline-4">
<h4 id="org68d3601"><b>Import</b>: <code>"std/math.earl"</code></h4>
</div>

<div id="outline-container-org3ba048e" class="outline-4">
<h4 id="org3ba048e"><b>Module</b>: <code>Math</code></h4>
</div>

<div id="outline-container-org86b594d" class="outline-4">
<h4 id="org86b594d"><b>Class List</b>: <i>None</i></h4>
</div>

<div id="outline-container-orga78104b" class="outline-4">
<h4 id="orga78104b"><b>Function List</b>:</h4>
</div>

<div id="outline-container-orgebf1852" class="outline-4">
<h4 id="orgebf1852"><code>max(x: int, y: int) -&gt; int</code></h4>
<div class="outline-text-4" id="text-orgebf1852">
<blockquote>
<p>
Returns the max between <code>x</code> and <code>y</code>.
</p>
</blockquote>
</div>
</div>
<div id="outline-container-org05bd024" class="outline-4">
<h4 id="org05bd024"><code>min(x: int, y: int) -&gt; int</code></h4>
<div class="outline-text-4" id="text-org05bd024">
<blockquote>
<p>
Returns the min between <code>x</code> and <code>y</code>.
</p>
</blockquote>
</div>
</div>
<div id="outline-container-org73da2de" class="outline-4">
<h4 id="org73da2de"><code>abs(x: int) -&gt;</code> \(\mathbb{Z}^+\)</h4>
<div class="outline-text-4" id="text-org73da2de">
<blockquote>
<p>
Returns the absolute value of <code>x</code>.
</p>
</blockquote>
</div>
</div>
</div>
<div id="outline-container-org38b4779" class="outline-3">
<h3 id="org38b4779">Utils</h3>
<div class="outline-text-3" id="text-org38b4779">
</div>
<div id="outline-container-org1f2fb2b" class="outline-4">
<h4 id="org1f2fb2b"><b>Import</b>: <code>"std/utils.earl"</code></h4>
</div>

<div id="outline-container-org8cbe6ed" class="outline-4">
<h4 id="org8cbe6ed"><b>Module</b>: <code>Utils</code></h4>
</div>

<div id="outline-container-org1f5fc1c" class="outline-4">
<h4 id="org1f5fc1c"><b>Class List</b>: <i>None</i></h4>
</div>

<div id="outline-container-org3bc1076" class="outline-4">
<h4 id="org3bc1076"><b>Function List</b>:</h4>
</div>

<div id="outline-container-orge602669" class="outline-4">
<h4 id="orge602669"><code>is_even(n: int) -&gt; bool</code></h4>
<div class="outline-text-4" id="text-orge602669">
<blockquote>
<p>
Returns <code>true</code> if <code>n</code> is even, <code>false</code> if odd.
</p>
</blockquote>
</div>
</div>
<div id="outline-container-org0122737" class="outline-4">
<h4 id="org0122737"><code>swap(@ref x1, @ref x2) -&gt; unit</code></h4>
<div class="outline-text-4" id="text-org0122737">
<blockquote>
<p>
Swaps the values of <code>x1</code> and <code>x2</code>.
</p>
</blockquote>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Zachary Haskins (malloc-nbytes)</p>
<p class="date">Created: 2024-07-02 Tue 22:46</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
